[{"model": "core.teammember", "pk": 1, "fields": {"name": "Paul", "surname": "Skinner", "position": "Founder and Director", "image": "", "created_at": "2018-02-21T22:19:56.532Z", "visual_priority": 1, "group": 0, "bio": "<p>Paul created Pimp My Cause and has led the platform to creating over &pound;18 million of social value, making pro bono marketing accessible to over 2,000 charities and social enterprises.&nbsp;</p>\r\n<p>He believes passionately in the role of marketing in identifying needs, formulating solutions and engaging support for those solutions in addressing social and environmental challenges as well as commercial ones and believes that marketers and good causes have a lot to learn from each other.</p>\r\n<p>Paul also runs the Agency of the Future through which he has pioneered the concept of Strategic Collaborative Advantage as a radical alternative to Strategic Competitive Advantage for a more inter-connected world.</p>\r\n<p>Paul is an Associate of Co-operatives UK, sits on the Council of the Internet Advertising Bureau and is a member of the Donor Advisory Group at the START Network.</p>"}}, {"model": "core.teammember", "pk": 2, "fields": {"name": "Anna", "surname": "Mullenneaux", "position": "Chief Matchmaker", "image": "", "created_at": "2018-02-21T22:20:25.318Z", "visual_priority": 2, "group": 0, "bio": "<p>Anna runs the pro bono marketing platform and from the beginning has led member engagement, community support and the marketing of the platform.<br /><br />Through her work Anna makes it easy for any marketer to find a cause to support using their marketing skills and works with marketing teams to expand their marketing capabilities while helping great causes. And she specialises in helping causes find the right marketers and organisation to provide the pro bono marketing support they need to grow and achieve their goals.<br /><br />She has a strong interest in sustainability and ethical marketing and embodies the spirit of Pimp My Cause in all her work.</p>\r\n<p>&nbsp;</p>"}}, {"model": "core.teammember", "pk": 3, "fields": {"name": "Steve", "surname": "Walker", "position": "Advisory Board Chairman", "image": "", "created_at": "2018-02-21T22:20:56.621Z", "visual_priority": 3, "group": 1, "bio": "<p>Steve Walker has 25 years marketing experience in the tech and communications industries and as Chief Marketing Officer of Sony Mobile Communications was responsible for the successful global launch of the world famous Sony brand into the dynamic smartphone industry.</p>\r\n<p>He believes strongly in the power of brands, communication and story-telling to transform businesses and social enterprises. He speaks and blogs frequently on the subjects of brand and marketing leadership and is passionate about helping individuals and teams to develop to their full potential.</p>\r\n<p>Steve chairs the Pimp My Cause advisory board and provides particular support with designing programmes that help businesses to develop their marketing talent by undertaking the challenge of cause marketing.</p>"}}, {"model": "core.teammember", "pk": 4, "fields": {"name": "Khalid", "surname": "Aziz", "position": "Advisory Board Member", "image": "", "created_at": "2018-02-21T22:21:50.075Z", "visual_priority": 4, "group": 1, "bio": "<p>Khalid&nbsp;Aziz has 18 years marketing experience, with the last 14 years in the communications market, having worked at O2, Orange and recently Lycamobile. He has both UK and international marketing experience and operational, strategic and commercial trade marketing experience.</p>\r\n<p>He established O2 as the &lsquo;home of text&rsquo; and Orange as then home of &lsquo;The Animal Talk Plans&rsquo;. He managed to drive both O2 and Orange to leading market positions in the Pay Monthly acquisition market. He also helped drive first to market launches at Orange Group for Mobile NFC, mobile Wi-Fi Calling and HD Mobile voice.</p>\r\n<p>In 2015, he achieved an MBA with Distinction from the University of Warwick and won the &lsquo;Rising Star of the Year&rsquo; winner at the 2017 British Muslim Awards.</p>\r\n<p>Khalid&nbsp;is dedicated to driving customer centricity, digitalisation and collaborative advantage in organisations.</p>"}}, {"model": "core.teammember", "pk": 5, "fields": {"name": "Marina", "surname": "Banks", "position": "Advisory Board Member", "image": "", "created_at": "2018-02-21T22:22:34.943Z", "visual_priority": 5, "group": 1, "bio": "<p>Marina has worked for Ogilvy for over 12 years, starting as an account executive and now as Head of Account Management. She is a managing partner with responsibility for client accounts for American Express UK,&nbsp;Mondel&egrave;z&nbsp;and Time to Change. She is often recognised for her drive and passion for the job, coupled with her popularity among clients and her peers.</p>\r\n<p>Marina co-founded the Women@Ogilvy network and is a great advocate for supporting women as they advance in the marketing profession.</p>\r\n<p>&nbsp;</p>"}}, {"model": "core.teammember", "pk": 6, "fields": {"name": "Catherine", "surname": "Cherry", "position": "Advisory Board Member", "image": "", "created_at": "2018-02-21T22:23:03.094Z", "visual_priority": 6, "group": 1, "bio": "<p>Catherine is Head of Fundraising, Individual Giving at NSPCC. Before moving to the charity sector she worked for Sony for over 14 years, ending her time there as Marketing Director of the UK, Ireland and the Netherlands.</p>\r\n<p><span>Catherine&rsquo;s interest in supporting good causes led her to run two Pimp My Cause Challenges programmes with her Sony Mobile team, which inspired her to personally support London Village Network with their marketing and communications.</span></p>\r\n<p><span style=\"color: #ffffff; font-family: Arial, Helvetica, Verdana; font-size: medium; background-color: #bc1451;\">&nbsp;</span></p>"}}, {"model": "core.teammember", "pk": 7, "fields": {"name": "Celia", "surname": "Pronto", "position": "Advisory Board Member", "image": "", "created_at": "2018-02-21T22:23:29.125Z", "visual_priority": 7, "group": 1, "bio": "<p>Celia is currently the Chief Customer Officer at Casual Dining Group, where she is responsible for driving business transformation across all areas of the business. Prior to this she spent a number of years at Ford Retail Group as Group Marketing and E-Commerce Director, where she was the first female appointed to the board.</p>\r\n<p>She started her career at consumer goods giant Unilever, and she has since worked in a variety of start-ups and multinational organisations in the travel, hospitality and leisure sectors, including Rank Group, STA Travel, Livebookings and InterContinental Hotels Group.</p>\r\n<p>She is a founder member of the London Chapter of the 2% club and Guardian Women in Leadership, as well as an active mentor and advocate of growing the pipeline of female talent.</p>"}}, {"model": "core.teammember", "pk": 8, "fields": {"name": "Sarah", "surname": "Speake", "position": "Advisory Board Member", "image": "", "created_at": "2018-02-21T22:23:54.188Z", "visual_priority": 8, "group": 1, "bio": "<p>Sarah Speake is Chief Marketing Officer of Truphone and was previously Chief Marketing Officer of Clear Channel and Director of Commercial Marketing &amp; Research at ITV. She has spent over 20 years working in media across a variety of international and local sales and marketing roles.&nbsp;Sarah&rsquo;s career includes 11 years working for technology media owners before joining Google, where she enjoyed 4 years as Technology Sales Director and 3 years as Strategic Marketing Director. She also sat on the Board of Carat Business for 2 years.</p>\r\n<p>As a passionate Marketer Sarah sits on the Board of the Marketing Society and is proud to be a member of WACL. She is also a qualified mentor and coach, having gained her Professional Accreditation in Coaching at Henley Business School. She currently mentors for The Marketing Academy and The Cherie Blair Foundation. She also sits on the board of Missing People.</p>\r\n<p>&nbsp;</p>"}}, {"model": "core.teammember", "pk": 9, "fields": {"name": "Stuart", "surname": "Wilson", "position": "Advisory Board Member", "image": "", "created_at": "2018-02-21T22:24:23.235Z", "visual_priority": 9, "group": 1, "bio": "<p>Stuart is a Group Partner at Shirlaws Group, a portfolio of companies that advise private enterprises how to grow, fund or exit their business and enjoy their life&rsquo;s work.</p>\r\n<p>Prior to this, Stuart enjoyed almost 30 years working with some of the world&rsquo;s favourite food brands. He was previously&nbsp;Chief Marketing Officer and then as Chief Commercial Officer&nbsp;at Burton&rsquo;s Biscuits. And during his time there they were awarded the Marketing Excellence Award for Marketing Leadership.</p>\r\n<p>Prior to Burton&rsquo;s, Stuart held increasingly senior Marketing and Strategy positions with Cadbury, Kraft Foods and Premier Foods in various UK, International (New York) and European (Zurich) roles.</p>\r\n<p>Stuart is&nbsp;also a Fellow of the Marketing Society and a Member of the Marketing Group of Great Britain.</p>\r\n<p>&nbsp;</p>"}}, {"model": "core.teammember", "pk": 10, "fields": {"name": "Liz", "surname": "Wilson", "position": "Ambassador for Engagement and Activation", "image": "", "created_at": "2018-02-21T22:24:54.146Z", "visual_priority": 10, "group": 2, "bio": "<p>Liz Wilson is CEO of integrated agency Stack whose clients include Peugeot, Citroen, Dixons and Ernest Jones, and whose charitable initiatives include supporting marketing for good via social enterprise PimpMyCause.</p>\r\n<p>Liz started her advertising career at Euro RSCG (Havas) and continued at TBWA and Lowe, working on household names including Heinz, Cadbury, Sony, News International and Unilever. She has also worked in strategic consulting at Brandhouse with a particular specialism in innovation and brand storytelling for FMCG, drinks and luxury goods businesses. &nbsp;</p>\r\n<p>Most recently she was Managing Director of Albion, an agency best known for its contribution to building some of the best-known digital businesses (Skype, Betfair, eBay). She joined Stack in late 2011 to give the agency new vision and energy and a new broader offer to support its work with brands right across the customer journey from acquisition to advocacy.</p>\r\n<p>She is a regular contributor to the advertising and marketing press, Chair of the IPA&rsquo;s Client Relationship Group and a member of IPA Council.&nbsp;</p>"}}, {"model": "core.teammember", "pk": 11, "fields": {"name": "Rory", "surname": "Sutherland", "position": "Ambassador for Behaviour Change", "image": "", "created_at": "2018-02-21T22:25:26.981Z", "visual_priority": 11, "group": 2, "bio": "<p>Rory is the Vice Chairman of the Ogilvy Group and the Executive Creative Director of OgilvyOne London.</p>\r\n<p>One of his first jobs in marketing was on the account of a little known company called Microsoft which led him to become one of the first ad men to truly understand the potential of digital and to merge marketing with internet technology. This fuelled his meteoric rise to some of the top jobs in advertising. More recently he has become a world-leading proponent of behavioural economics and how it can be used to re-invent our approach to marketing with a greater understanding of how people actually make decisions. His expert knowledge and forward-thinking approaches have continuously inspired his contemporaries, delivered by way of his 'The Wiki Man' column at The Spectator, his blog with Campaign Brand Republic and his many keynote talks at major conferences including TED.</p>\r\n<p>&nbsp;</p>"}}, {"model": "core.teammember", "pk": 12, "fields": {"name": "Rachel", "surname": "Botsman", "position": "Ambassador for a Collaborative Society", "image": "", "created_at": "2018-02-21T22:25:52.487Z", "visual_priority": 12, "group": 2, "bio": "<p>Rachel Botsman is a social innovator who writes, consults and speaks on the power of collaboration and sharing through network technologies.</p>\r\n<p>She has inspired a new consumer economy with her influential book What's Mine is Yours: How Collaborative Consumption Is Changing The Way We Live. TIME Magazine recently called Collaborative Consumption one of the \"10 Ideas That Will Change The World\".</p>\r\n<p>Her thinking on how technology will change how we work, consume and live has featured in WIRED, The Guardian, Harvard Business Review, CNN, New York Times, The Economist and Fast Company.</p>\r\n<p>A former director at President Clinton&rsquo;s Foundation, Rachel founded the Collaborative Lab, a leading source of strategic support for businesses, governments and entrepreneurs who want to change the world.</p>\r\n<div class=\"mttSeparator\">&nbsp;</div>"}}, {"model": "core.teammember", "pk": 13, "fields": {"name": "Roy", "surname": "Sandbach", "position": "Ambassador for Partnership Innovation", "image": "", "created_at": "2018-02-21T22:26:23.148Z", "visual_priority": 13, "group": 2, "bio": "<p>Roy is Professor of Creative Design at Cranfield University, having been at the forefront of brand innovation with Procter &amp; Gamble for 30 years.</p>\r\n<p>He is experienced in working across the globe with multinationals, SMEs and NGOs. One of his inventions alone became a 100MM$ business in the US and he has created several business programmes aiming to bring base-of-pyramid populations out of their extreme poverty.</p>\r\n<p>Roy is passionate about collaborative innovation as a force for good and supports Pimp My Cause in terms of our innovation and brand strategy. He is committed to building our impact through his worldwide network of collaborators and his constant challenge to us is \"where next ?\"!</p>\r\n<p>&nbsp;</p>"}}, {"model": "core.teammember", "pk": 14, "fields": {"name": "Sir Tom", "surname": "Shebbeare", "position": "Ambassador for Private and Voluntary Sector Collaboration", "image": "", "created_at": "2018-02-21T22:26:51.901Z", "visual_priority": 14, "group": 2, "bio": "<p>For over twenty years Tom was The Prince of Wales's principal adviser on charitable affairs. Having joined His Royal Highness as the first Director of The Prince's Trust in 1988, he became the Director of The Prince's Charities (the largest multi-cause charitable enterprise in the UK) in 2004.</p>\r\n<p>From 1980 to 1987 Tom was a member of the Secretariat of The Council of Europe in Strasbourg.</p>\r\n<p>Tom is now Chairman of Virgin Money Giving and award-winning documentary maker Spring Films.</p>\r\n<p>He is a Director of CIM Investment Management and of Delphis-Eco Ltd, a Trustee of The Prince's Charitable Foundation (China), The Turquoise Mountain Foundation (Afghanistan) and Queens College London, and a Fellow of Green-Templeton College Oxford.</p>\r\n<p>Tom was knighted in 2003.</p>"}}, {"model": "core.teammember", "pk": 15, "fields": {"name": "aladin", "surname": "", "position": "Strategic Counsel", "image": "", "created_at": "2018-02-21T22:27:27.510Z", "visual_priority": 15, "group": 2, "bio": "<p><span>aladin has been a core part of Pimp My Cause since its launch playing a vital role in helping us to innovate and develop our network. He has shared the experience of a career which is immune to categorisation, ranging as it does from international public diplomacy to interdisciplinary arts practice. aladin&nbsp;has been a leading and bipartisan figure in the civic ecology of the UK for the past two decades: he is currently&nbsp;strategic counsel to the Big Society, consults widely on civil society initiatives globally and as Chair of the Cultural Strategy Group for London for Mayor Livingstone was in charge of creating the first integrated cultural strategy for any capital city.</span></p>"}}, {"model": "core.teammember", "pk": 16, "fields": {"name": "Chris", "surname": "Austin", "position": "Ambassador for International Development", "image": "", "created_at": "2018-02-21T22:27:56.524Z", "visual_priority": 16, "group": 2, "bio": "<p>Since August 2011, Chris has been Head of the Conflict, Humanitarian and Security Department (CHASE). CHASE is responsible for the UK&rsquo;s responses to natural disaster emergencies and core funding to the international humanitarian system (Red Cross, UN agencies); for DFID&rsquo;s role in the UK government&rsquo;s Building Stability Overseas Strategy (including the Conflict Pool), with FCO and MOD; for policy advice on security &amp; justice issues to DFID country offices; and for DFID&rsquo;s work on tackling violence against women and girls in developing countries.Chris has been extremely generous in helping Pimp My Cause to increase our positive impact on international development.</p>\r\n<div class=\"mttSeparator\">&nbsp;</div>"}}, {"model": "core.teammember", "pk": 17, "fields": {"name": "Alex", "surname": "Epstein", "position": "Marketing Ambassador", "image": "", "created_at": "2018-02-21T22:28:26.837Z", "visual_priority": 17, "group": 2, "bio": "<p>Alex was our first Ambassador and has been generously and actively supporting Pimp My Cause since before we were even launched.</p>\r\n<p>Alex is an expert in brand storytelling and is helping organizations across diverse sectors to develop their own unique identity.</p>\r\n<p>He is well known for his appearance in Series 6 of the BBC&rsquo;s Apprentice, delivers key note speeches and consults widely as well as developing his own entrepreneurial ventures.</p>\r\n<p>&nbsp;</p>"}}, {"model": "core.teammember", "pk": 18, "fields": {"name": "Melody", "surname": "Hossaini", "position": "Social Enterprise Ambassador", "image": "", "created_at": "2018-02-21T22:34:47.083Z", "visual_priority": 18, "group": 2, "bio": "<p>Melody is CEO of the multi-award winning social enterprise, InspirEngage International. She is one of the leading youth sector figures in the UK having reached over a million young people in over 100 countries. At 13, she helped establish a leading democratic youth organisation, and in 2005 made history becoming the first female (and ethnic minority) to be elected Chair of its Board of Trustees. She has been trained by Archbishop Desmond Tutu and former vice-president Al Gore and her work with the Commonwealth Heads of Government has even featured in the Queen&rsquo;s Christmas day speech.</p>\r\n<p>In 2011, Melody was the first ever Social Entrepreneur to compete on the BBC&rsquo;s Apprentice and was described by Lord Sugar as &ldquo;a woman of exceptional ability&rdquo;. Melody works with Pimp My Cause on social enterprise and youth development.</p>"}}, {"model": "core.teammember", "pk": 19, "fields": {"name": "Michael", "surname": "Norton OBE", "position": "Ambassador for Social Innovation", "image": "", "created_at": "2018-02-21T22:36:11.217Z", "visual_priority": 19, "group": 2, "bio": "<p>Michael runs the&nbsp;Centre for Innovation in Voluntary Action through where he has created a raft of innovative projects worldwide including: street children banks in South Asia; village publishing in India; Changemakers, YouthBank,&nbsp;FoodWorks&nbsp;and MyBnk all of which provide opportunities to young people to take an active role in society. He co-founded UnLtd to support social etnrpreneurs and founded&nbsp;&nbsp;Buzzbnk, an internet platform enabling the crowdfunding of social ventures. He has authored &ldquo;365 Ways to Change the World&rdquo; , &ldquo;The Everyday Activist&rdquo; and several books on fundraising. He is currently establishing the International Centre for Social Franchising and has a Professorship at the Graduate Business School, University of Cape Town.</p>\r\n<p>&nbsp;</p>"}}, {"model": "core.teammember", "pk": 20, "fields": {"name": "Damian", "surname": "Ryan", "position": "Ambassador for Digital Marketing", "image": "", "created_at": "2018-02-21T22:36:43.595Z", "visual_priority": 20, "group": 2, "bio": "<p><span>Damian is the author of &ldquo;The Best Digital Marketing Campaigns in the World&rdquo; and is a digital media and marketing expert who has been working at the forefront of the media industry for 27 years. He established the first digital agency in the United Kingdom and Ireland in 1997 before moving into corporate finance as a digital media specialist. He is now a founding partner of mediaventura.com. The transition to digital innovation and communications is a key challenge common to the vast majority of our causes and Damian&rsquo;s insights are helping us access the knowledge of the digital sector to address this need.</span></p>"}}, {"model": "core.teammember", "pk": 21, "fields": {"name": "James", "surname": "Taylor", "position": "Head of Special Projects", "image": "", "created_at": "2018-02-21T22:37:30.667Z", "visual_priority": 21, "group": 2, "bio": "<p>James Taylor is founder of Altogether Media which specialises in bringing together co-production and distribution partners for factual television projects. He also works on bringing factual content to non-broadcast partners and developing and managing projects for digital platforms.</p>\r\n<p>James has been involved with high profile programmes such as the BAFTA award-winning &lsquo;Flying Monsters 3D&rsquo;, the Emmy award-winning &lsquo;David Attenborough&rsquo;s First Life&rsquo; and the feature documentary &lsquo;The Wildest Dream&rsquo;.</p>\r\n<p>He co-authored bestselling books &lsquo;Spitfire Ace&rsquo; and &lsquo;Bomber Crew&rsquo;, has been a member of the Advisory Committee for the Edinburgh International Television Festival and a juror twice for the International Emmy Awards.</p>\r\n<p>He is working with Pimp My Cause on new initiatives that will expand the platform&rsquo;s scope to make a difference.</p>\r\n<div class=\"mttSeparator\">&nbsp;</div>"}}, {"model": "core.teammember", "pk": 22, "fields": {"name": "Dave", "surname": "Crowther", "position": "Head of Innovation", "image": "", "created_at": "2018-02-21T22:37:56.334Z", "visual_priority": 22, "group": 2, "bio": "<p>Dave is passionate about thinking differently to solve our most important problems. He has first-hand experience of combining the right people and platforms to create the right future: from&nbsp;co-founding a Web 3.0 company later acquired by the world's third largest software company to a rapidly growing social enterprise providing daily money management for vulnerable individuals. Dave was a co-contributor to the global best-seller, Business Model Generation, created an innovation programme that IBM reported delivering &ldquo;startling benefits unachievable by other means\" and trained executives from 50 countries. He still struggles up hills on his bike.</p>\r\n<p>&nbsp;</p>"}}, {"model": "core.teammember", "pk": 23, "fields": {"name": "Adrian", "surname": "West", "position": "Collaborative Design Adviser", "image": "", "created_at": "2018-02-21T22:38:22.984Z", "visual_priority": 23, "group": 2, "bio": "<p>Adrian co-founded the shared virtual realities research group at the University of Manchester. He led European and UK contributions in psychology and computer science, and was an expert project reviewer in technology for the European Commission. Adrian ran a team of engineers at a venture capital funded research spin-off company sold to IBM in 2008. He has inspired some 200 cross-disciplinary research teams, spent time as research director for a thinking skills organisation, and now facilitates thinking for corporations. The thread linking this all together is 'mind' and how working together can be more constructively enjoyable for us all &ndash; with technology, or without.</p>\r\n<div class=\"mttSeparator\">&nbsp;</div>"}}, {"model": "core.teammember", "pk": 24, "fields": {"name": "Sophie", "surname": "Brown", "position": "Collaborative Design Adviser", "image": "", "created_at": "2018-02-21T22:39:01.681Z", "visual_priority": 24, "group": 2, "bio": "<p>Sophie studied Fine Art at Edinburgh University, and has run her own technology-based graphics company. She is a qualified Landscape Designer who has run contracts for Manchester Airport, charitable regeneration agencies and regional developments in the North West, and has managed substantial community engagement in the design and planning process. Sophie has held professional roles in planning within Government, and been Creative Director for a world-wide innovation brand. She is passionate about designing visual communications and thinking processes to facilitate positive change through creative collaboration.</p>\r\n<p>&nbsp;</p>"}}, {"model": "core.teammember", "pk": 25, "fields": {"name": "Jeanette Clement", "surname": "Clement", "position": "Designer", "image": "", "created_at": "2018-02-21T22:39:31.362Z", "visual_priority": 26, "group": 2, "bio": "<p>Jeanette designed the Pimp My Cause website and provides ongoing pro bono support to our causes. She has over 10 years of Graphic Design experience and moves effortlessly between print and web where she can manage projects from concept to implementation. Jeanette runs her own design practice, Clement Graphics.</p>\r\n<p>&nbsp;</p>"}}, {"model": "core.teammember", "pk": 26, "fields": {"name": "James", "surname": "Firminger", "position": "Web Developer", "image": "", "created_at": "2018-02-21T22:40:14.668Z", "visual_priority": 26, "group": 2, "bio": "<div id=\"page\">\r\n<div id=\"container\">\r\n<div id=\"applicationWrapper\">\r\n<div id=\"main\">\r\n<div id=\"staticContent\">\r\n<div class=\"meetTheTeam\">\r\n<p>James single-handedly built the majority of the Pimp My Cause platform and has been one of the project&rsquo;s heroes from the start. He now works for Fluid Creative as a senior web developer.</p>\r\n</div>\r\n</div>\r\n</div>\r\n<div id=\"rightSide\">&nbsp;</div>\r\n<div class=\"clearer\">&nbsp;</div>\r\n</div>\r\n</div>\r\n</div>\r\n<div id=\"customerfooterContainer\">&nbsp;</div>"}}]
